In [1]:
import numpy as np
import pandas as pd

In [2]:
data = {'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
        'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
        'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

0. Создать датафрейм.

In [9]:
df = pd.DataFrame(data, index=labels)

1. Вывести информацию о датафрейме.

In [14]:
df

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, a to j
Data columns (total 4 columns):
animal      10 non-null object
age         8 non-null float64
visits      10 non-null int64
priority    10 non-null object
dtypes: float64(1), int64(1), object(2)
memory usage: 400.0+ bytes

2. Вернуть первые 3 строки DataFrame df.

In [15]:
df.iloc[:3]

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no

In [16]:
df.head(3)

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no

3. Выберите только столбцы 'animal' и 'age' из DataFrame df.

In [34]:
df[['animal', 'age']]

  animal  age
a    cat  2.5
b    cat  3.0
c  snake  0.5
d    dog  NaN
e    dog  5.0
f    cat  2.0
g  snake  4.5
h    cat  NaN
i    dog  7.0
j    dog  3.0

4. Выберите данные в строках [3, 4, 8] и в столбцах ['animal', 'age'].

In [58]:
df.loc[['d','e','i'],['animal','age']]

  animal  age
d    dog  NaN
e    dog  5.0
i    dog  7.0

5. Выберите строки где количество посещений больше 3

In [79]:
df[df['visits'] > 3]

Empty DataFrame
Columns: [animal, age, visits, priority]
Index: []

6. Выберите строки, в которых отсутствует возраст.

In [101]:
df[df['age'].isnull()]

  animal  age  visits priority
d    dog  NaN       3      yes
h    cat  NaN       1      yes

7. Выберите строки, в которых животное является кошкой и возраст составляет менее 3 лет.

In [102]:
df[(df['animal'] == 'cat') & (df['age'] < 3)]

  animal  age  visits priority
a    cat  2.5       1      yes
f    cat  2.0       3       no

8. Выберите строки в которых возраст от 2 до 4 (включительно).

In [103]:
df[df['age'].between(2, 4)]

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
f    cat  2.0       3       no
j    dog  3.0       1       no

9. Измените возраст в строке 'f' на 1,5.

In [104]:
df.loc['f', 'age'] = 1.5

10. Рассчитать общее количество всех посещений

In [155]:
df['visits'].sum()

19

11. Расчитайте суммарный возраст животных

In [187]:
df.groupby('animal').sum()['age']

animal
cat       7.0
dog      15.0
snake     5.0
Name: age, dtype: float64

12. Добавьте новую строку k к df со значениями по вашему желанию. Затем удалите ее.

In [195]:
df.loc['k'] = [5.5, 'dog', 'no', 2]
print()
df = df.drop('k')
print(df)

  animal  age visits priority
a    cat  2.5      1      yes
b    cat    3      3      yes
c  snake  0.5      2       no
d    dog  NaN      3      yes
e    dog    5      2       no
f    cat  1.5      3       no
g  snake  4.5      1       no
h    cat  NaN      1      yes
i    dog    7      2       no
j    dog    3      1       no

13. Подсчитайте количество животных каждого типа в df.

In [196]:
df['animal'].value_counts()

dog      4
cat      4
snake    2
Name: animal, dtype: int64

14. Сортируйте df сначала по значениям в 'age' в возрастающем порядке, затем по значениям в столбце 'visit' в возрастающем порядке.

In [245]:
df.sort_values(by=['age', 'visits'], ascending=[False, True])

  animal  age visits priority
i    dog    7      2       no
e    dog    5      2       no
g  snake  4.5      1       no
j    dog    3      1       no
b    cat    3      3      yes
a    cat  2.5      1      yes
f    cat  1.5      3       no
c  snake  0.5      2       no
h    cat  NaN      1      yes
d    dog  NaN      3      yes

15. В столбце приоритет замените значения на Yes и No

In [272]:
df.loc[df.priority=='yes', 'priority'] = 'no'
df

  animal  age visits priority
a    cat  2.5      1       no
b    cat    3      3       no
c  snake  0.5      2       no
d    dog  NaN      3       no
e    dog    5      2       no
f    cat  1.5      3       no
g  snake  4.5      1       no
h    cat  NaN      1       no
i    dog    7      2       no
j    dog    3      1       no

16. В столбце «animal» измените записи «snake» на «python».

In [311]:
df['animal'] = df['animal'].replace('snake', 'python')

17. Удалите все повторения строк из таблицы

20. Предположим, у вас есть DataFrame с 10 столбцами действительных чисел, например: